app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("amount", "created_at", "description", "updated_at") VALUES (?, ?, ?, ?)  [["amount", 200.0], ["created_at", "2014-07-21 13:13:41.386187"], ["description", "CV gfvbb"], ["updated_at", "2014-07-21 13:13:41.386187"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "amount" = ?, "updated_at" = ? WHERE "items"."id" = 8  [["amount", 101.0], ["updated_at", "2014-07-21 15:54:07.632828"]]

  def destroy
    @item.destroy
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 3]]

    def set_item
      @item = Item.find(params[:id])
---
SELECT "items".* FROM "items"  WHERE ("items"."created_at" BETWEEN '2014-07-14' AND '2014-07-21')